>>> server -> client: 40ba401f7ced9168 , 4093b148b4395810
>>> Cycle()
>> 01 03 00 14 00 04 04 0D
Modbus ErrorCallback: <modbus:1:holding: 20>: no error
Modbus Callback: <modbus:1:holding: 20> becomes 6720.123
<< 01 03 08 40 BA 40 1F 7C ED 91 68 F4 F5
>> 01 03 00 18 00 04 C4 0E
Modbus ErrorCallback: <modbus:1:holding: 24>: no error
Modbus Callback: <modbus:1:holding: 24> becomes 0
<< 01 03 08 00 00 00 00 00 00 00 00 95 D7
>> 01 04 00 1E 00 04 91 CF
Modbus ErrorCallback: <modbus:1:input: 30>: no error
Modbus Callback: <modbus:1:input: 30> becomes 1260.321
<< 01 04 08 40 93 B1 48 B4 39 58 10 B5 2A
>>> client -> server: 10
>>> Cycle()
>> 01 10 00 14 00 04 08 40 25 FF F2 E4 8E 8A 72 6A FC
<< 01 10 00 14 00 04 81 CE
>> 01 03 00 14 00 04 04 0D
Modbus Callback: <modbus:1:holding: 20> becomes 10.9999 [unchanged]
<< 01 03 08 40 25 FF F2 E4 8E 8A 72 79 61
>> 01 03 00 18 00 04 C4 0E
Modbus Callback: <modbus:1:holding: 24> becomes 0 [unchanged]
<< 01 03 08 00 00 00 00 00 00 00 00 95 D7
>> 01 04 00 1E 00 04 91 CF
Modbus Callback: <modbus:1:input: 30> becomes 1260.321 [unchanged]
<< 01 04 08 40 93 B1 48 B4 39 58 10 B5 2A
>>> client -> server: -0.00123
>>> Cycle()
>> 01 10 00 14 00 04 08 BF 54 26 FE 71 8A 86 D7 EE 81
<< 01 10 00 14 00 04 81 CE
>> 01 03 00 14 00 04 04 0D
Modbus Callback: <modbus:1:holding: 20> becomes -0.00123 [unchanged]
<< 01 03 08 BF 54 26 FE 71 8A 86 D7 FD 1C
>> 01 03 00 18 00 04 C4 0E
Modbus Callback: <modbus:1:holding: 24> becomes 0 [unchanged]
<< 01 03 08 00 00 00 00 00 00 00 00 95 D7
>> 01 04 00 1E 00 04 91 CF
Modbus Callback: <modbus:1:input: 30> becomes 1260.321 [unchanged]
<< 01 04 08 40 93 B1 48 B4 39 58 10 B5 2A
>>> client -> server: -0.123 (scaled)
>>> Cycle()
>> 01 10 00 18 00 04 08 BF 54 26 FE 71 8A 86 D7 FE 91
<< 01 10 00 18 00 04 41 CD
>> 01 03 00 14 00 04 04 0D
Modbus Callback: <modbus:1:holding: 20> becomes -0.00123 [unchanged]
<< 01 03 08 BF 54 26 FE 71 8A 86 D7 FD 1C
>> 01 03 00 18 00 04 C4 0E
Modbus Callback: <modbus:1:holding: 24> becomes -0.123 [unchanged]
<< 01 03 08 BF 54 26 FE 71 8A 86 D7 FD 1C
>> 01 04 00 1E 00 04 91 CF
Modbus Callback: <modbus:1:input: 30> becomes 1260.321 [unchanged]
<< 01 04 08 40 93 B1 48 B4 39 58 10 B5 2A
>>> server -> client: 4093b00000000000 (scaled)
>>> Cycle()
>> 01 03 00 14 00 04 04 0D
Modbus Callback: <modbus:1:holding: 20> becomes -0.00123 [unchanged]
<< 01 03 08 BF 54 26 FE 71 8A 86 D7 FD 1C
>> 01 03 00 18 00 04 C4 0E
Modbus Callback: <modbus:1:holding: 24> becomes 126000
<< 01 03 08 40 93 B0 00 00 00 00 00 28 DE
>> 01 04 00 1E 00 04 91 CF
Modbus Callback: <modbus:1:input: 30> becomes 1260.321 [unchanged]
<< 01 04 08 40 93 B1 48 B4 39 58 10 B5 2A
(pty-based fake serial -- stopping forwarding)
